Revit 2026 API

# CurveTessellate Method

---

Valid only if the curve is bound. Returns a polyline approximation to the curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<XYZ> Tessellate()
```
```vb
Public Function Tessellate As IList(Of XYZ)
```
```cpp
public:
IList<XYZ^>^ Tessellate()
```
```fsharp
member Tessellate : unit -> IList<XYZ>
```

#### Return Value

IListXYZ

Tolerance of approximation is defined internally by Revit to be adequate for display purposes.

#### Reference

Curve Class

Autodesk.Revit.DB Namespace